IRP/src/InformationRegisters/PartnerSegments/PartnerSegments.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>PartnerSegments</name>
  <dimensions>
    <name>Segment</name>
    <type>
      <types>CatalogRef.PartnerSegments</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/PartnerSegments/ManagerModule.bsl
Function GetSegmentsRefArrayByPartner(Partner) Export
	ReturnValue = New Array;
	Query = New Query;
	Query.Text = "SELECT
		|	PartnerSegments.Segment
		|FROM
		|	InformationRegister.PartnerSegments AS PartnerSegments
		|WHERE
		|	PartnerSegments.Partner = &Partner";
	Query.SetParameter("Partner", Partner);
	QueryExecute = Query.Execute();
	If Not QueryExecute.IsEmpty() Then
		QueryUnload = QueryExecute.Unload();
		ReturnValue = QueryUnload.UnloadColumn("Segment");
	EndIf;
	Return ReturnValue;
EndFunction
